app/Controllers/Laporan.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data['transaksi'] = $db->table('transaksi_parkir t')
            ->select('t.*, j.nama_jenis, l.nama_lantai')
            ->join('jenis_kendaraan j', 'j.id_jenis = t.id_jenis')
            ->join('lantai l', 'l.id_lantai = t.id_lantai')
            ->where('t.status', 'keluar')
            ->orderBy('t.jam_keluar', 'DESC')
            ->get()->getResultArray();
---
SELECT `t`.*, `j`.`nama_jenis`, `l`.`nama_lantai`
FROM `transaksi_parkir` `t`
JOIN `jenis_kendaraan` `j` ON `j`.`id_jenis` = `t`.`id_jenis`
JOIN `lantai` `l` ON `l`.`id_lantai` = `t`.`id_lantai`
WHERE `t`.`status` = 'keluar'
ORDER BY `t`.`jam_keluar` DESC