app/Controllers/Master.php

SELECT *
FROM `lantai`
---
    public function lantai() {
        $data['lantai'] = $this->db->table('lantai')->get()->getResultArray();

SELECT *
FROM `kartu_rfid`
---
    public function rfid() {
        $data['kartu'] = $this->db->table('kartu_rfid')->get()->getResultArray();

SELECT *
FROM `jenis_kendaraan`
---
    public function jenis()
    {
        $data['jenis'] = $this->db->table('jenis_kendaraan')->get()->getResultArray();