app/Controllers/Parkir.php

    public function masuk() {
        $data['kartu'] = $this->db->table('kartu_rfid')->getWhere(['status' => 'tersedia'])->getResultArray();
        $data['lantai'] = $this->db->table('lantai')->get()->getResultArray();
        $data['jenis'] = $this->db->table('jenis_kendaraan')->get()->getResultArray();
---
SELECT *
FROM `kartu_rfid`
WHERE `status` = 'tersedia'
SELECT *
FROM `lantai`
SELECT *
FROM `jenis_kendaraan`

    public function proses_masuk() {
        $rfid = $this->request->getPost('rfid_code');
        $id_lantai = $this->request->getPost('id_lantai');

        $this->db->table('transaksi_parkir')->insert([
            'rfid_code' => $rfid,
            'nopol'     => $this->request->getPost('nopol'),
            'id_jenis'  => $this->request->getPost('id_jenis'),
            'id_lantai' => $id_lantai,
            'jam_masuk' => date('Y-m-d H:i:s'),
            'status'    => 'masuk'
        ]);

        $this->db->table('kartu_rfid')->where('rfid_code', $rfid)->update(['status' => 'digunakan']);
        $this->db->table('lantai')->where('id_lantai', $id_lantai)->increment('terisi');
---
INSERT INTO `transaksi_parkir` (`rfid_code`, `nopol`, `id_jenis`, `id_lantai`, `jam_masuk`, `status`) VALUES ('RFID002', 'B 1234 AB', '1', '5', '2026-01-28 16:34:48', 'masuk')
UPDATE `kartu_rfid` SET `status` = 'digunakan'
WHERE `rfid_code` = 'RFID002'
UPDATE `lantai` SET `terisi` = `terisi` + 1
WHERE `id_lantai` = '5'

    public function keluar()
    {

        $data['parkir_aktif'] = $this->db->table('transaksi_parkir t')
            ->select('t.*, j.nama_jenis, j.tarif')
            ->join('jenis_kendaraan j', 'j.id_jenis = t.id_jenis')
            ->where('t.status', 'masuk')
            ->get()->getResultArray();
---
SELECT `t`.*, `j`.`nama_jenis`, `j`.`tarif`
FROM `transaksi_parkir` `t`
JOIN `jenis_kendaraan` `j` ON `j`.`id_jenis` = `t`.`id_jenis`
WHERE `t`.`status` = 'masuk'